backend/app/models/offer.rb

  def no_duplicate_pending_offers
    if new_record? && Offer.exists?(company_id: company_id, intern_id: intern_id, status: :pending)
---
SELECT 1 AS one FROM "offers" WHERE "offers"."company_id" = 6 AND "offers"."intern_id" = 12 AND "offers"."status" = 0 LIMIT 1