backend/app/models/user.rb

INSERT INTO "intern_profiles" ("user_id", "name", "bio", "school", "major", "expected_graduation", "skills", "github_url", "portfolio_url", "location", "created_at", "updated_at") VALUES (11, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-03-29 02:27:02.332104', '2025-03-29 02:27:02.332104') RETURNING "id"
INSERT INTO "company_profiles" ("user_id", "company_name", "description", "industry", "location", "website", "company_size", "logo", "created_at", "updated_at") VALUES (10, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-03-29 02:26:44.240552', '2025-03-29 02:26:44.240552') RETURNING "id"
---
     def create_profile
      if self.user_type == 'intern'
        InternProfile.create(user: self)
      elsif self.user_type == 'company'
        CompanyProfile.create(user: self)