backend/app/controllers/application_controller.rb

  def current_user
    return nil unless auth_header
    token = auth_header.split(' ')[1]
    begin
      decoded = JWT.decode(token, Rails.application.credentials.secret_key_base)[0]
      @current_user ||= User.find(decoded["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1