backend/app/controllers/api/v1/companies_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 31 AND "users"."user_type" = 'company' LIMIT 1
---
  def show
    @company = User.find_by(id: params[:id], user_type: 'company')