backend/app/controllers/api/v1/interns_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 AND "users"."user_type" = 'intern' LIMIT 1
---
  def show
    @intern = User.find_by(id: params[:id], user_type: 'intern')