backend/app/controllers/api/v1/messages_controller.rb

  def index
    messages = Message.all.limit(50)
---
SELECT "messages".* FROM "messages" ORDER BY "messages"."created_at" DESC LIMIT 50

  def create
    message = Message.new(message_params)
    message.user = current_user if current_user

    if message.save
---
INSERT INTO "messages" ("nickname", "content", "user_id", "created_at", "updated_at") VALUES ('てら', 'パワーフェイス！！', 53, '2025-04-02 08:20:31.277964', '2025-04-02 08:20:31.277964') RETURNING "id"