backend/app/controllers/api/v1/offers_controller.rb

  def index
    if current_user.company?
      offers = current_user.sent_offers.includes(:intern)
      render json: offers.as_json(include: { intern: { only: [:id, :name, :email], methods: [:skills_array] } })
    elsif current_user.intern?
      offers = current_user.received_offers.includes(:company)
---
SELECT "offers".* FROM "offers" WHERE "offers"."company_id" = 6
SELECT "offers".* FROM "offers" WHERE "offers"."intern_id" = 12

  def create
    unless current_user.company?
      return render json: { error: '権限がありません' }, status: :forbidden
    end

    @offer = Offer.new(offer_params)
    @offer.company_id = current_user.id
    @offer.status = :pending

    if @offer.save
---
INSERT INTO "offers" ("company_id", "intern_id", "message", "position", "details", "status", "created_at", "updated_at") VALUES (6, 12, 'がんばろう', 'ソフトウェアエンジニア', 'あああ', 0, '2025-04-02 02:21:30.163986', '2025-04-02 02:21:30.163986') RETURNING "id"

  def update
    unless current_user.intern? && @offer.intern_id == current_user.id
      return render json: { error: '権限がありません' }, status: :forbidden
    end

    if @offer.update(offer_status_params)
---
UPDATE "offers" SET "status" = 1, "updated_at" = '2025-04-02 02:58:45.877857' WHERE "offers"."id" = 1

  def set_offer
    @offer = Offer.find(params[:id])
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = 1 LIMIT 1