backend/app/controllers/api/v1/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "user_type", "name", "company_name", "company_description", "skills", "bio", "created_at", "updated_at") VALUES ('test_intern@example.com', '$2a$12$MLZstKI0Rq2e6fEqOdKw3.HVRTuK/1FLP6SEtBQ/7.zh8EVGNpvk.', 'intern', 'テスト太郎', NULL, NULL, 'JavaScript, React', 'テスト用インターン生です', '2025-03-28 02:53:25.543120', '2025-03-28 02:53:25.543120') RETURNING "id"

  def index
    # 企業ユーザーがインターン生一覧を取得する場合
    if current_user.user_type == 'company' && params[:type] != 'companies'
      interns = User.where(user_type: 'intern')
      render json: interns.map { |intern| user_response(intern) }
    # インターン生ユーザーが企業一覧を取得する場合
    elsif current_user.user_type == 'intern' && params[:type] == 'companies'
      companies = User.where(user_type: 'company').includes(:company_profile)
      companies_data = companies.map do |company|
---
SELECT "users".* FROM "users" WHERE "users"."user_type" = 'intern'
SELECT "company_profiles".* FROM "company_profiles" WHERE "company_profiles"."user_id" IN (31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 52)
SELECT "users".* FROM "users" WHERE "users"."user_type" = 'company'